InformationRegisters/НастройкиПечатиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПечатиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПечатиОбъектов/Forms/ФормаСписка/Ext/Form/Module.bsl
//gorkov, UT10-303

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНастройкиПечатиОбъектов();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НастройкиПечатиОбъектов" Тогда
		ЗаполнитьНастройкиПечатиОбъектов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиПечатиОбъектов

&НаКлиенте
Процедура НастройкиПечатиОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Перем КлючЗаписи;
	
	Если Элемент.ТекущийЭлемент = Элементы.НастройкиПечатиОбъектовПредставление И
		Элементы.НастройкиПечатиОбъектов.ТекущиеДанные <> Неопределено И 
		Элементы.НастройкиПечатиОбъектов.ТекущиеДанные.ИндексКартинки = 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТипОбъекта  = "";
		Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Контрагент  = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		
		ТекущиеДанные = Элементы.НастройкиПечатиОбъектов.ТекущиеДанные;
		
		Если ТипЗнч(ТекущиеДанные.Настройка) = Тип("Строка") Тогда
			ТипОбъекта = ТекущиеДанные.Настройка;
		ИначеЕсли ТипЗнч(ТекущиеДанные.Настройка) = Тип("СправочникСсылка.Организации") Тогда
			ТипОбъекта  = ТекущиеДанные.ПолучитьРодителя().Настройка;
			Организация = ТекущиеДанные.Настройка;
		ИначеЕсли ТипЗнч(ТекущиеДанные.Настройка) = Тип("СправочникСсылка.Контрагенты") Тогда
			ТипОбъекта  = ТекущиеДанные.ПолучитьРодителя().ПолучитьРодителя().Настройка;
			Организация = ТекущиеДанные.ПолучитьРодителя().Настройка;
			Контрагент     = ТекущиеДанные.Настройка;
		КонецЕсли;
		
		ДанныеКлючаЗаписи = Новый Структура();
		ДанныеКлючаЗаписи.Вставить("ТипОбъекта",  ТипОбъекта);
		ДанныеКлючаЗаписи.Вставить("Организация", Организация);
		ДанныеКлючаЗаписи.Вставить("Контрагент",  Контрагент);
		
		Если ЗаписьСуществует(ДанныеКлючаЗаписи) Тогда
			МассивПараметровКонструктора = Новый Массив();
			МассивПараметровКонструктора.Добавить(ДанныеКлючаЗаписи);
			
			КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.НастройкиПечатиОбъектов", МассивПараметровКонструктора);
		КонецЕсли;
		
		ОткрытьФорму(
			"РегистрСведений.НастройкиПечатиОбъектов.ФормаЗаписи",
			Новый Структура("Ключ,ЗначенияЗаполнения",
			КлючЗаписи, ДанныеКлючаЗаписи),,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиПечатиОбъектов.ФормаЗаписи",,,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекущиеДанные = Элементы.НастройкиПечатиОбъектов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Укажите настройку печати для удаления'"));
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ИндексКартинки = 1 Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Невозможно удалить группировку'"));
		Возврат;
	КонецЕсли;
	
	СписокКнопок = Новый СписокЗначений();
	СписокКнопок.Добавить("Удалить", НСтр("ru = 'Удалить'"));
	СписокКнопок.Добавить("НеУдалять", НСтр("ru = 'Не удалять'"));
	
	ОтветНаВопрос = Неопределено;

	
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьЗавершение", ЭтаФорма, Новый Структура("ТекущиеДанные", ТекущиеДанные)), НСтр("ru = 'Удалить настройку печати?'"), СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
    
    
    ОтветНаВопрос = РезультатВопроса;
    
    Если ОтветНаВопрос = "НеУдалять" Тогда
        Возврат;
    КонецЕсли;
    
    ОчиститьСообщения();
    УдалитьНастройкуПечатиСервер(ТекущиеДанные.ПолучитьИдентификатор());

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьНастройкиПечатиОбъектов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройкиПечатиОбъектов()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	НастройкиПечатиОбъектов.ТипОбъекта  КАК ТипОбъекта,
	|	НастройкиПечатиОбъектов.Организация КАК Организация,
	|	НастройкиПечатиОбъектов.Контрагент  КАК Контрагент
	|ИЗ
	|	РегистрСведений.НастройкиПечатиОбъектов КАК НастройкиПечатиОбъектов
	|УПОРЯДОЧИТЬ ПО
	|	ТипОбъекта,
	|	Организация,
	|	Контрагент
	|ИТОГИ ПО
	|	ТипОбъекта,
	|	Организация,
	|	Контрагент");
	
	РезультатЗапроса = Запрос.Выполнить();
	НастройкиПечатиОбъектов.ПолучитьЭлементы().Очистить();
	ДеревоЗначений = РеквизитФормыВЗначение("НастройкиПечатиОбъектов");
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаТипОбъекта = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаТипОбъекта.Следующий() Цикл
			
			СтрокаТипОбъекта = ДеревоЗначений.Строки.Добавить();
			СтрокаТипОбъекта.Настройка = ВыборкаТипОбъекта.ТипОбъекта;
			СтрокаТипОбъекта.Представление = Метаданные.НайтиПоПолномуИмени(ВыборкаТипОбъекта.ТипОбъекта).Представление();
			СтрокаТипОбъекта.ИндексКартинки = 1;
			
			ВыборкаОрганизация = ВыборкаТипОбъекта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаОрганизация.Следующий() Цикл
				
				Если Не ЗначениеЗаполнено(ВыборкаОрганизация.Организация) Тогда
					СтрокаТипОбъекта.ИндексКартинки = 0;
					//Продолжить;
				КонецЕсли;
				
				СтрокаОрганизация = СтрокаТипОбъекта.Строки.Добавить();
				СтрокаОрганизация.Настройка = ВыборкаОрганизация.Организация;
				СтрокаОрганизация.Представление = ВыборкаОрганизация.Организация;
				СтрокаОрганизация.ИндексКартинки = 1;
				
				ВыборкаКонтрагент = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаКонтрагент.Следующий() Цикл
					
					Если Не ЗначениеЗаполнено(ВыборкаКонтрагент.Контрагент) Тогда
						СтрокаОрганизация.ИндексКартинки = 0;
						//Продолжить;
					КонецЕсли;
					
					СтрокаКонтрагент = СтрокаОрганизация.Строки.Добавить();
					СтрокаКонтрагент.Настройка = ВыборкаКонтрагент.Контрагент;
					СтрокаКонтрагент.Представление = ВыборкаКонтрагент.Контрагент;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;

	ЗначениеВРеквизитФормы(ДеревоЗначений, "НастройкиПечатиОбъектов");
	
КонецПроцедуры

&НаСервере
Функция УдалитьНастройкуПечатиСервер(ИдентификаторСтроки)
	
	ТипОбъекта  = "";
	Организация = Справочники.Организации.ПустаяСсылка();
	Контрагент  = Справочники.Контрагенты.ПустаяСсылка();
	
	ТекущиеДанные = НастройкиПечатиОбъектов.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.Настройка) = Тип("Строка") Тогда
		//Если Не ПраваПользователяПовтИсп.СохранениеНастроекПечатиОбъектовПоУмолчанию() Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет прав на удаление настройки печати'"));
		//	Возврат Ложь;
		//Иначе
			ТипОбъекта = ТекущиеДанные.Настройка;
		//КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущиеДанные.Настройка) = Тип("СправочникСсылка.Организации") Тогда
		//Если Не ПраваПользователяПовтИсп.СохранениеНастроекПечатиОбъектовПоУмолчанию() Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет прав на удаление настройки печати по организации'"));
		//	Возврат Ложь;
		//Иначе
			ТипОбъекта  = ТекущиеДанные.ПолучитьРодителя().Настройка;
			Организация = ТекущиеДанные.Настройка;
		//КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущиеДанные.Настройка) = Тип("СправочникСсылка.Контрагенты") Тогда
		//Если Не ПраваПользователяПовтИсп.ДобавлениеИзменениеНастройкиПечатиОбъектов() Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет прав на удаление настройки печати по контрагенту'"));
		//	Возврат Ложь;
		//Иначе
			ТипОбъекта  = ТекущиеДанные.ПолучитьРодителя().ПолучитьРодителя().Настройка;
			Организация = ТекущиеДанные.ПолучитьРодителя().Настройка;
			Контрагент  = ТекущиеДанные.Настройка;
		//КонецЕсли;
	КонецЕсли;
	
	ДанныеКлючаЗаписи = Новый Структура();
	ДанныеКлючаЗаписи.Вставить("ТипОбъекта",  ТипОбъекта);
	ДанныеКлючаЗаписи.Вставить("Организация", Организация);
	ДанныеКлючаЗаписи.Вставить("Контрагент",  Контрагент);
	
	Если ЗаписьСуществует(ДанныеКлючаЗаписи) Тогда
		
		МассивПараметровКонструктора = Новый Массив();
		МассивПараметровКонструктора.Добавить(ДанныеКлючаЗаписи);
		РегистрыСведений.НастройкиПечатиОбъектов.УдалитьНастройкиПечатиОбъекта(ТипОбъекта, Организация, Контрагент);
		ЗаполнитьНастройкиПечатиОбъектов();
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ЗаписьСуществует(ДанныеКлючаЗаписи)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НастройкиУчетныхЗаписейЭлектроннойПочты.ТипОбъекта
	|ИЗ
	|	РегистрСведений.НастройкиПечатиОбъектов КАК НастройкиУчетныхЗаписейЭлектроннойПочты
	|ГДЕ
	|	НастройкиУчетныхЗаписейЭлектроннойПочты.ТипОбъекта = &ТипОбъекта
	|	И НастройкиУчетныхЗаписейЭлектроннойПочты.Организация = &Организация
	|	И НастройкиУчетныхЗаписейЭлектроннойПочты.Контрагент = &Контрагент
	|");
	
	Запрос.УстановитьПараметр("ТипОбъекта",  ДанныеКлючаЗаписи.ТипОбъекта);
	Запрос.УстановитьПараметр("Организация", ДанныеКлючаЗаписи.Организация);
	Запрос.УстановитьПараметр("Контрагент",  ДанныеКлючаЗаписи.Контрагент);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

///gorkov
